-- 문제1. 평균급여보다 더 높은 급여를 받는 사원들의 정보를 조회하시오.


-- 문제2. 사원번호가 1001인 사원과 같은 직급을 가진 사원들의 정보를 조회하시오.

       
-- 문제3. 가장 급여가 높은 사원과 가장 급여가 낮은 사원을 조회하시오.

 
-- 문제1. 부서번호가 1인 부서에 존재하는 직급과 같은 직급을 가지고있는 모든 사원을 조회하시오.


-- 문제2. 구창민과 같은 부서에서 근무하는 사원을 조회하시오.


-- 문제3. 부서번호가 1인 부서에서 근무하는 사원들의 모든 급여보다 큰 급여를 받는 사원들을 조회하시오.


-- 문제1. 모든 사원들의 평균연봉과 부서수를 조회하시오.


/*
    실행순서
    1. FROM
    2. WHERE
    3. GROUP BY
    4. HAVING
    5. SELECT
    6. ORDER BY
*/

-- 문제. 부서번호가 1인 사원을 조회하시오. 이름순으로 정렬


-- 문제. EMPLOYEE테이블의 구조와 데이터를 모두 복사해서 새로운 EMPLOYEE2 테이블을 생성하시오.


-- 문제. EMPLOYEE테이블의 데이터를 제외하고 구조만 복사해서 EMPLOYEE3 테이블을 생성하시오.



    